## 1-2 Create Pandas Data Frame Object

Pandas data frame is like R data frame, 2D array with row and column labels.

To be formal about it:

* data can be of any Python type
* data in each column must be homogenous
* numerical row indices by default

In [88]:
import pandas
import datetime

In [89]:
# create list of dates from 12-01 to 12-07

dt = datetime.datetime(2015,12,1)
end = datetime.datetime(2015,12,7)
step = datetime.timedelta(days=1)

dates = [] # initialize the list

# populate
while dt <= end:
    dates.append(dt.strftime('%m-%d'))
    dt += step

# view result    
dates

['12-01', '12-02', '12-03', '12-04', '12-05', '12-06', '12-07']

In [90]:
# make a dictionary 
d = {'Date' : dates, 
     'Tokyo': [15,19,15,11,9,8,13],
     'Paris' : [-2,0,2,5,7,-5,-3],
     'Mumbai' : [20,18,23,19,25,27,23]    
    }

d

{'Date': ['12-01', '12-02', '12-03', '12-04', '12-05', '12-06', '12-07'],
 'Mumbai': [20, 18, 23, 19, 25, 27, 23],
 'Paris': [-2, 0, 2, 5, 7, -5, -3],
 'Tokyo': [15, 19, 15, 11, 9, 8, 13]}

### 1.23 Example 1: Create a dataframe from a python dict of equal length lists

In [91]:
# create the data frame
temps = pandas.DataFrame(d)

temps

    Date  Mumbai  Paris  Tokyo
0  12-01      20     -2     15
1  12-02      18      0     19
2  12-03      23      2     15
3  12-04      19      5     11
4  12-05      25      7      9
5  12-06      27     -5      8
6  12-07      23     -3     13

In [92]:
# access columns like this (code completion works here)
temps.Mumbai

0    20
1    18
2    23
3    19
4    25
5    27
6    23
Name: Mumbai, dtype: int64

In [93]:
# or like an array
temps['Tokyo']

0    15
1    19
2    15
3    11
4     9
5     8
6    13
Name: Tokyo, dtype: int64

In [94]:
# data type is indeed a df
type(temps)

pandas.core.frame.DataFrame

In [95]:
# columns have been cast to pandas series objects
type(temps.Mumbai)

pandas.core.series.Series

In [96]:
# extract the series back out
ntemp = temps['Mumbai']

ntemp

0    20
1    18
2    23
3    19
4    25
5    27
6    23
Name: Mumbai, dtype: int64

In [97]:
# the default row index
temps = pandas.DataFrame(d)

temps

    Date  Mumbai  Paris  Tokyo
0  12-01      20     -2     15
1  12-02      18      0     19
2  12-03      23      2     15
3  12-04      19      5     11
4  12-05      25      7      9
5  12-06      27     -5      8
6  12-07      23     -3     13

In [98]:
# set a new row index

temps = temps.set_index(temps.Date)

# this syntax adds redundancy, but lets you add/change many times without error
temps = temps.set_index(temps.Mumbai)
temps = temps.set_index(temps.Date)

temps

        Date  Mumbai  Paris  Tokyo
Date
12-01  12-01      20     -2     15
12-02  12-02      18      0     19
12-03  12-03      23      2     15
12-04  12-04      19      5     11
12-05  12-05      25      7      9
12-06  12-06      27     -5      8
12-07  12-07      23     -3     13

In [99]:
# set a new row index without the redundant column
temps = temps.set_index('Mumbai')

# this syntax has removed the Mumbai column; set index again, and that data is lost
# temps = temps.set_index('Date')

temps

         Date  Paris  Tokyo
Mumbai
20      12-01     -2     15
18      12-02      0     19
23      12-03      2     15
19      12-04      5     11
25      12-05      7      9
27      12-06     -5      8
23      12-07     -3     13

### 1.24 Example 2: Create dataframe from a csv file

In [100]:
# load the kaggle.com titanic dataset
url = "https://raw.github.com/mattdelhey/kaggle-titanic/master/Data/train.csv"
titanic = pandas.read_csv(url)

titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 11 columns):
survived    891 non-null int64
pclass      891 non-null int64
name        891 non-null object
sex         891 non-null object
age         714 non-null float64
sibsp       891 non-null int64
parch       891 non-null int64
ticket      891 non-null object
fare        891 non-null float64
cabin       204 non-null object
embarked    889 non-null object
dtypes: float64(2), int64(4), object(5)

In [101]:
# head() works
titanic.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [102]:
# so does tail()
titanic.tail()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
886,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.00,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.00,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.00,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,NaN,Q

In [103]:
# reference columns by name, get totals by factor with value_counts()
titanic.sex.value_counts()

male      577
female    314
dtype: int64

In [104]:
# use head() with value_counts()
titanic.fare.value_counts().head()

8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
dtype: int64

In [105]:
# value_counts on a boolean
titanic.survived.value_counts()

0    549
1    342
dtype: int64